In [3]:
import pandas as pd

In [5]:
data = pd.read_csv('./fake-company.csv')

In [6]:
data.head()

   Year     Name Department  Age  Salary
0  1990    Alice         HR   25   50000
1  1990      Bob         RD   30   48000
2  1990  Charlie      Admin   45   55000
3  1991   Dakota         HR   26   52000
4  1991     Elsa         RD   31   50000

In [8]:
data.shape

(9, 5)

In [11]:
data.describe()

              Year        Age        Salary
count     9.000000   9.000000      9.000000
mean   1991.000000  32.222222  54333.333333
std       0.866025   7.870479   5147.815070
min    1990.000000  25.000000  48000.000000
25%    1990.000000  27.000000  50000.000000
50%    1991.000000  30.000000  52000.000000
75%    1992.000000  32.000000  60000.000000
max    1992.000000  46.000000  62000.000000

In [12]:
data2 = pd.read_csv('./goog-1.csv')

In [23]:
close_less_than_50 = data2["Close"] < 50
low_more_than_50 = data2["Close"] > 50

data2[close_less_than_50]

,Date,Open,High,Low,Close,Adj Close,Volume
0,2004-08-19,49.676899,51.693783,47.669952,49.845802,49.845802,44994500
9,2004-09-01,51.018177,51.152302,49.512966,49.801090,49.801090,9206800
11,2004-09-03,50.148830,50.541279,49.339096,49.681866,49.681866,5191000

In [15]:
data2.shape

(3313, 7)

In [24]:
data2.to_csv("my_clean_data.csv")